<h2>Experiences professionnelles</h2>

<ul id='timeline'>
  <li class='work'>
    <input class='radio' id='work5' name='works' type='checkbox'>
    <div class="relative">
      <label for='work5'>
        Stage chez Cr&eacute;dit Logement
        <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" width="30" height="30" viewBox="0 0 128 128">
          <path d="M82.1 117.9c.4 0 .8-.1 1.2-.2 1.5-.6 2.3-2.4 1.6-3.9l-9.3-22.3h20.4c2 0 3.9-1.2 4.6-3.1.8-1.9.3-4-1.2-5.5L56.5 41.1c-1.4-1.4-3.6-1.8-5.4-1-1.9.8-3 2.6-3 4.6v60.2c0 2.1 1.2 3.9 3.2 4.7.6.2 1.2.4 1.8.4 1.4 0 2.7-.6 3.6-1.6l13.5-14.4 9.2 22.2C79.9 117.2 81 117.9 82.1 117.9zM40.6 22.7c.5 1.2 1.6 1.8 2.8 1.8.4 0 .8-.1 1.2-.2 1.5-.6 2.3-2.4 1.6-3.9L40.3 6.5c-.6-1.5-2.4-2.3-3.9-1.6-1.5.6-2.3 2.4-1.6 3.9L40.6 22.7zM16.7 32.4L31 36.9c.3.1.6.1.9.1 1.3 0 2.5-.8 2.9-2.1.5-1.6-.4-3.3-2-3.8l-14.3-4.5c-1.6-.5-3.3.4-3.8 2C14.2 30.2 15.1 31.9 16.7 32.4zM58.9 24.9c.4.2.9.3 1.4.3 1.1 0 2.1-.6 2.7-1.6l7-13.3c.8-1.5.2-3.3-1.3-4-1.5-.8-3.3-.2-4 1.3l-7 13.3C56.9 22.4 57.4 24.2 58.9 24.9z"></path>
        </svg>
      </label>
      <span class='date'>1<sup>er</sup> juillet 2024</span>
      <span class='circle'></span>
    </div>
    <div class='content'>
      <p>&#9;Ce stage a &eacute;t&eacute; r&eacute;alis&eacute; dans le cadre de la validation de ma deuxi&egrave;me ann&eacute;e d'&eacute;tude &agrave; Paris Ynov Campus. Il a dur&eacute;e deux mois et c'est d&eacute;roul&eacute; en juillet et en ao&ucirc;t 2024 au sein de l'entreprise Cr&eacute;dit Logement.</p>
      <img style="height: 40%; width: 40%; margin-left: 27%" src="https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/CL-Logo_Cr%C3%A9dit_Logement_Wiki.png/1920px-CL-Logo_Cr%C3%A9dit_Logement_Wiki.png" alt="credit_logement_photo">
      <p>&#9;Cr&eacute;dit Logement est une soci&eacute;t&eacute; de financement sp&eacute;cialiste de la garantie (caution) de pr&ecirc;ts immobiliers aux particuliers distribu&eacute;s par les banques. La garantie propos&eacute;e est une alternative &agrave; la prise d'hypoth&egrave;que lors de l'octroi d'un pr&ecirc;t immobilier par une banque. Elle a &eacute;t&eacute; cr&eacute;&eacute;e en 1975 et est situ&eacute;e dans le 3<sup>&egrave;me</sup> arrondissement de Paris. Cr&eacute;dit Logement s'occupe de pr&egrave;s de 60% du march&eacute; immobilier fran&ccedil;ais pour un total d'environ 420 milliards d'euros.</p>
      <p>&#9;La garantie financi&egrave;re Cr&eacute;dit Logement repose sur le principe de la mutualisation des risques. C'est-&agrave;-dire que chaque emprunteur fait un versement dans un fonds mutuel de garantie (FMG). C'est une sorte de pot commun. Ce fond mutuel est d&eacute;fini par l'ACPR (Autorit&eacute; de contr&ocirc;le prudentiel et de r&eacute;solution). C'est une institution int&eacute;gr&eacute;e &agrave; la Banque de France, charg&eacute;e de la surveillance de l'activit&eacute; des banques et des assurances en France.</p>
      <p>&#9;J'ai travaill&eacute; au sein de la direction du risque et des mod&egrave;les de garanties (DRM) au service du risque de cr&eacute;dit (SRC). Ils s'occupent de cr&eacute;er des r&egrave;gles de risques avec des &eacute;tudes et des suivis de statistique. Pour cela, l'un de leurs outils utilis&eacute; est un mod&egrave;le d'estimation de la valeur d'un bien immobilier.</p>
      <p class="titre_article"><b>Ma mission</b></p>
      <p>&#9;J'avais pour mission de r&eacute;cup&eacute;rer les donn&eacute;es open source du gouvernement sur les cadastres, de les nettoyer, de les formater et de les ins&eacute;rer dans la base de donn&eacute;es de Cr&eacute;dit Logement afin qu'elles soient utilis&eacute;es dans le mod&egrave;le d'estimation de valeur des biens.</p>
      <img style="width: 50%; height: 60%; margin-left: 25%;" src="https://imgs.search.brave.com/D9A1fYOnUS-DkAy3G93lNeAzLLtosqjipP2MvR1zJg0/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly93d3cu/dm9zLWRlbWFyY2hl/cy5jb20vbWVkaWFz/L2ltZy9zb3VyY2Uv/dXJiYW5pc21lL3By/ZWZpeGUtc2VjdGlv/bi1jYWRhc3RyYWxl/LmpwZw" alt="photo cadastres">
      <p>-------------------------------------------------------------</p>
      <a href="https://cadastre.data.gouv.fr/">Site du gouvernement</a>
      <p>&#9;Le cadastre est un ensemble de plans et fichiers administratifs qui recensent toutes les propri&eacute;t&eacute;s immobili&egrave;res situ&eacute;es dans chaque commune fran&ccedil;aise, et qui en consigne la valeur afin de servir de base de calcul &agrave; certains imp&ocirc;ts.</p>
      <p>-------------------------------------------------------------</p>
      <p>&#9;Ma mission s'est divis&eacute;e en quatre parties :</p>
      <p>&#9;<b>La reconnaissance :</b> Il s'agit de tout le travail qui consiste &agrave; prendre connaissance des donn&eacute;es qui sont mise &agrave; ma disposition : comprendre quel fichier correspond &agrave; quel type de donn&eacute;es, comprendre comment les donn&eacute;es sont structur&eacute;es dans les fichiers, comprendre comment elles sont li&eacute;es entre elles et enfin d&eacute;finir quelles donn&eacute;es seront utiles pour l'apprentissage du mod&egrave;le. J'ai &eacute;galement t&eacute;l&eacute;charg&eacute; des fichiers contenant des adresses li&eacute;es aux cadastres pour avoir plus d'informations sur les parcelles &eacute;tant donn&eacute; que le mod&egrave;le travaille avec des adresses.</p>
      <p>&#9;<b>La r&eacute;cup&eacute;ration des donn&eacute;es :</b> Cette partie consiste &agrave; t&eacute;l&eacute;charger les donn&eacute;es et &agrave; les ranger dans un dossier de travail afin qu'elles soient accessibles facilement dans le code. La VM sur laquelle je travaillais n'avait pas acc&egrave;s &agrave; internet alors le t&eacute;l&eacute;chargement des fichiers a &eacute;t&eacute; fait manuellement. Puis j'ai transf&eacute;r&eacute; les fichiers d'un disque &agrave; l'autre avant de les ranger dans mon dossier de travail.</p>
      <p>&#9;<b>Le formatage des donn&eacute;es :</b> Cette partie &agrave; sans doute &eacute;t&eacute; la plus longue et la plus compliqu&eacute;e de mon stage. Je n'avais jamais travaill&eacute; avec autant de donn&eacute;es et le probl&egrave;me d'optimisation du code s'est rapidement fait ressentir. Le but a &eacute;t&eacute; de transformer les fichiers que j'ai t&eacute;l&eacute;charg&eacute;s en data frame afin de pouvoir formatter les donn&eacute;es, les fusionner et enfin avoir un seul data frame faisant la synth&egrave;se de tous les autres. J'ai pu r&eacute;cup&eacute;rer des informations sur les piscines, les points d'eaux (&eacute;tangs, lacs, mares), les parkings et les terrasses et bien sur les adresses li&eacute;es aux parcelles.</p>
      <p>&#9;<b>L'insertion des donn&eacute;es dans la BDD :</b> Cette partie a &eacute;t&eacute; la plus simple. J'ai cr&eacute;&eacute; une table correspondant parfaitement &agrave; mon data frame final et j'ai utilis&eacute; le code d&eacute;j&agrave; cr&eacute;er par mes coll&egrave;gues pour ins&eacute;rer les donn&eacute;es dans la base de donn&eacute;es.</p>
      <p class="titre_article"><b>Les difficult&eacute;s rencontr&eacute;es</b></p>
      <p>Les difficult&eacute;s que j'ai rencontr&eacute;es sont toutes apparues dans la partie formatage des donn&eacute;es avec <b>l'optimisation du code</b>.</p>
      <p>La premi&egrave;re difficult&eacute; rencontr&eacute;e est apparue pendant la lecture des fichiers par mon code python. J'avais plus de 700 fichiers &agrave; lire avec un total de plus de 100 millions de lignes de donn&eacute;es &agrave; r&eacute;cup&eacute;rer des fichiers t&eacute;l&eacute;charger. C'&eacute;tait interminable ! Pour palier &agrave; ce probl&egrave;me, j'ai appris &agrave; faire du parall&eacute;lisme avec python en ex&eacute;cutant plusieurs t&acirc;ches simples et r&eacute;p&eacute;titives en m&ecirc;me temps, comme lire des fichiers. J'ai pu d&eacute;couvrir la biblioth&egrave;que Joblib me permettant d'optimiser mon travail en divisant le temps d'ex&eacute;cution de cette partie du code par 24 (car j'avais 24 processeurs &agrave; ma disposition).</p>
      <p>La deuxi&egrave;me difficult&eacute; est apparue au moment de faire des op&eacute;rations de formatage et de fusion sur les data frames. Au d&eacute;but, j'utilisais la biblioth&egrave;que Pandas pour ce genre d'op&eacute;ration mais elle est beaucoup moins efficace quand il s'agit de traiter plus de 100 millions de lignes de donn&eacute;es. J'ai donc r&eacute;&eacute;crit mon code en utilisant la biblioth&egrave;que Polars sur conseil d'un de mes coll&egrave;gues. L&agrave; encore, le temps gagn&eacute; sur l'ex&eacute;cution du code fut plut&ocirc;t cons&eacute;quent.</p>
      <div style="display: flex; flex-direction: row; justify-content: center; align-items: center; ">
        <img style="width: 30%; height: 30%; display: inline; margin-right: 20%;" src="https://realpython.com/cdn-cgi/image/width=960,format=auto/https://files.realpython.com/media/Showcase-Polars_Watermarked.4e25d4f6c9a7.jpg" alt="polars">
        <img style="width: 30%; height: 30%; display: inline;" src="https://imgs.search.brave.com/nS7O74QBuGiJn9kw57V4LjA-Zzn6pOKlBKXjr6Kmo0s/rs:fit:500:0:0:0/g:ce/aHR0cHM6Ly9kYXRh/c2NpZW50ZXN0LmNv/bS93cC1jb250ZW50/L3VwbG9hZHMvMjAy/Mi8wMS9pbGx1X3Bh/bmRhcy04Mi0xMDI0/eDU2Mi5wbmc" alt="pandas">
      </div>
      <p class="titre_article"><b>Enseignement du stage</b></p>
      <p>Ce stage a &eacute;t&eacute; ma premi&egrave;re exp&eacute;rience professionnelle. J'&eacute;tais dans un environnement de travail agr&eacute;able avec des coll&egrave;gues &agrave; l'&eacute;coute et investis dans mon apprentissage. Cet environnement sain m'a permis de m'&eacute;panouir et de progresser en programmation. J'ai pu comprendre le fonctionnement d'une entreprise de l'int&eacute;rieur et travailler sur un projet concret. La mission qui m'a &eacute;t&eacute; confi&eacute;e &eacute;tait tr&egrave;s int&eacute;ressante et en lien direct avec la suite de mon parcours. Elle m'a aussi permis de d&eacute;velopper mes comp&eacute;tences gr&acirc;ce aux difficult&eacute;s rencontr&eacute;es et &agrave; l'apprentissage de nouvelles biblioth&egrave;ques python. Ca a &eacute;t&eacute; une exp&eacute;rience tr&egrave;s enrichissante.</p>
    </div>
  </li>
  <li class='work'>
    <input class='radio' id='work3' name='works' type='checkbox'>
    <div class="relative">
      <label for='work3'>
        Alternance chez Abeille Assurances
        <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" width="30" height="30" viewBox="0 0 128 128">
          <path d="M82.1 117.9c.4 0 .8-.1 1.2-.2 1.5-.6 2.3-2.4 1.6-3.9l-9.3-22.3h20.4c2 0 3.9-1.2 4.6-3.1.8-1.9.3-4-1.2-5.5L56.5 41.1c-1.4-1.4-3.6-1.8-5.4-1-1.9.8-3 2.6-3 4.6v60.2c0 2.1 1.2 3.9 3.2 4.7.6.2 1.2.4 1.8.4 1.4 0 2.7-.6 3.6-1.6l13.5-14.4 9.2 22.2C79.9 117.2 81 117.9 82.1 117.9zM40.6 22.7c.5 1.2 1.6 1.8 2.8 1.8.4 0 .8-.1 1.2-.2 1.5-.6 2.3-2.4 1.6-3.9L40.3 6.5c-.6-1.5-2.4-2.3-3.9-1.6-1.5.6-2.3 2.4-1.6 3.9L40.6 22.7zM16.7 32.4L31 36.9c.3.1.6.1.9.1 1.3 0 2.5-.8 2.9-2.1.5-1.6-.4-3.3-2-3.8l-14.3-4.5c-1.6-.5-3.3.4-3.8 2C14.2 30.2 15.1 31.9 16.7 32.4zM58.9 24.9c.4.2.9.3 1.4.3 1.1 0 2.1-.6 2.7-1.6l7-13.3c.8-1.5.2-3.3-1.3-4-1.5-.8-3.3-.2-4 1.3l-7 13.3C56.9 22.4 57.4 24.2 58.9 24.9z"></path>
        </svg>
      </label>
      <span class='date'>23 Septembre 2024 </span>
      <span class='circle'></span>
    </div>
    <div class='content'>
      <p>
        Article sur l'alternance (&agrave; venir)
      </p>
    </div>
  </li>
</ul>
